Milestones.md


# Time Left (~28 weeks)

-   9 weeks left in semester
-   ~4 weeks break
-   15 weeks second semester


# High level milestones/objectives


## Objective for this semester (semester 1)

-   100% lockdown on concept
-   Workable draft for (at least) several aspects of the game
-   Contact High-school/college teachers to play-test game
-   Identification of &ldquo;stretch-goals&rdquo; that are not pertinent to finished game, but can be added if time allows


## Objective for break

-   Ideally nothing
-   This time can be used to make up for time lost this semester


## Objective for next semester (semester 2)

-   Finish game to alpha state (ideally within first 4-6 weeks)
-   Polish game (up till the deadline)
    -   Respond to play-test feedback if able
    -   Work on stretch goals
-   Publish game in some manner (steam, app store, website)
-   Plan out any future additions beyond senior project if everything gets done on time


# Semester 1 Tasks

-   [ ] Develop soundtrack/sound design for game | @adediu25
-   [ ] Develop UI for game | @adediu25
-   [ ] Research biology curriculum, lock in concepts | @IllustratedMan-code
-   [ ] Design main game-loop (with help) | @IllustratedMan-code
-   [ ] Program scene scripts in Godot Engine | @adediu25
-   [ ] Research Godot Engine implementations for our ideas | @adediu25
-   [ ] Setup Automation and CI/CD | @john-whiting
-   [ ] Implement Game Trait System (with assistance) | @john-whiting
-   [ ] Establish documentation standards | @ConnorMcKinney99
-   [ ] Research asset library | @ConnorMcKinney99
-   Buy drawing tablet | @ConnorMcKinney99
-   [ ] Prototype mini-games | @ConnorMcKinney99
-   [ ] Asset Creation (art style) | Needs Person
-   [ ] Highschool outreach | All


# Semester 2 Tasks

-   [ ] Playtest completed game levels/features | @adediu25
-   [ ] Implement Asset Animations | @john-whiting
-   [ ] Highschool outreach/testing | All
-   [ ] Export/Platform distribution | @john-whiting


# Tables

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Task</th>
<th scope="col" class="org-left">Person assigned</th>
<th scope="col" class="org-left">Date Started</th>
<th scope="col" class="org-left">Date Finished</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Develop soundtrack/sound design for game</td>
<td class="org-left">@adediu25</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">12/9/2023</td>
</tr>


<tr>
<td class="org-left">Develop UI for game</td>
<td class="org-left">@adediu25</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">11/4/2023</td>
</tr>


<tr>
<td class="org-left">Research biology curriculum, lock in concepts</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">10/7/2023</td>
</tr>


<tr>
<td class="org-left">Design main game-loop (with help)</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">11/4/2023</td>
</tr>


<tr>
<td class="org-left">Program scene scripts in Godot Engine</td>
<td class="org-left">@adediu25</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">12/9/2023</td>
</tr>


<tr>
<td class="org-left">Research Godot Engine implementations for our ideas</td>
<td class="org-left">@adediu25</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">10/7/2023</td>
</tr>


<tr>
<td class="org-left">Setup Automation and CI/CD</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">11/4/2023</td>
</tr>


<tr>
<td class="org-left">Implement Game Trait System (with assistance)</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">12/9/2023</td>
</tr>


<tr>
<td class="org-left">Establish documentation standards</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">10/7/2023</td>
</tr>


<tr>
<td class="org-left">Research asset library</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">10/7/2023</td>
</tr>


<tr>
<td class="org-left">Buy drawing tablet</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Done</td>
</tr>


<tr>
<td class="org-left">Highschool outreach</td>
<td class="org-left">All</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">12/9/2023</td>
</tr>


<tr>
<td class="org-left">Prototype mini-games</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">12/9/2023</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Asset Creation (art style)</td>
<td class="org-left">Needs Person</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">3/1/2024</td>
</tr>


<tr>
<td class="org-left">Playtest completed game levels/features</td>
<td class="org-left">@adediu25</td>
<td class="org-left">1/8/2024</td>
<td class="org-left">3/1/2024</td>
</tr>


<tr>
<td class="org-left">Implement Asset Animations</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">1/8/2024</td>
<td class="org-left">2/1/2024</td>
</tr>


<tr>
<td class="org-left">Highschool outreach/testing</td>
<td class="org-left">All</td>
<td class="org-left">1/8/2024</td>
<td class="org-left">3/1/2024</td>
</tr>


<tr>
<td class="org-left">Export/Platform distribution</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">1/8/2024</td>
<td class="org-left">3/1/2024</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Takes minutes - David Lewis</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>


<tr>
<td class="org-left">Specify Weekly Tasks - David Lewis</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>


<tr>
<td class="org-left">Maintain project organization (Github strategy)</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>


<tr>
<td class="org-left">Maintain Code Standards</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>


<tr>
<td class="org-left">Review Pull Requests</td>
<td class="org-left">@john-whiting</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>


<tr>
<td class="org-left">Enforce documentation standards</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-left">10/29/2023</td>
<td class="org-left">Ongoing</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Task</th>
<th scope="col" class="org-left">Person assigned</th>
<th scope="col" class="org-right">David Effort</th>
<th scope="col" class="org-right">Alex Effort</th>
<th scope="col" class="org-right">John Effort</th>
<th scope="col" class="org-right">Connor Effort</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Develop soundtrack/sound design for game</td>
<td class="org-left">@adediu25</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Develop UI for game</td>
<td class="org-left">@adediu25</td>
<td class="org-right">10%</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Research biology curriculum, lock in concepts</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Design main game-loop (with help)</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-right">40%</td>
<td class="org-right">20%</td>
<td class="org-right">20%</td>
<td class="org-right">20%</td>
</tr>


<tr>
<td class="org-left">Program scene scripts in Godot Engine</td>
<td class="org-left">@adediu25</td>
<td class="org-right">10%</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Research Godot Engine implementations for our ideas</td>
<td class="org-left">@adediu25</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Setup Automation and CI/CD</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Implement Game Trait System (with assistance)</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">20%</td>
<td class="org-right">10%</td>
<td class="org-right">40%</td>
<td class="org-right">30%</td>
</tr>


<tr>
<td class="org-left">Establish documentation standards</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
</tr>


<tr>
<td class="org-left">Research asset library</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
</tr>


<tr>
<td class="org-left">Buy drawing tablet</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
</tr>


<tr>
<td class="org-left">Highschool outreach</td>
<td class="org-left">All</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Prototype mini-games</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-right">20%</td>
<td class="org-right">20%</td>
<td class="org-right">20%</td>
<td class="org-right">40%</td>
</tr>


<tr>
<td class="org-left">Asset Creation (art style)</td>
<td class="org-left">All</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
</tr>


<tr>
<td class="org-left">Playtest completed game levels/features</td>
<td class="org-left">@adediu25</td>
<td class="org-right">10%</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Implement Asset Animations</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Highschool outreach/testing</td>
<td class="org-left">ALL</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
<td class="org-right">25%</td>
</tr>


<tr>
<td class="org-left">Export/Platform distribution</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">Takes minutes - David Lewis</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Specify Weekly Tasks - David Lewis</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Maintain project organization (Github strategy)</td>
<td class="org-left">@IllustratedMan-code</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Maintain Code Standards</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Review Pull Requests</td>
<td class="org-left">@john-whiting</td>
<td class="org-right">10%</td>
<td class="org-right">10%</td>
<td class="org-right">70%</td>
<td class="org-right">10%</td>
</tr>


<tr>
<td class="org-left">Enforce documentation standards</td>
<td class="org-left">@ConnorMcKinney99</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100%</td>
</tr>
</tbody>
</table>

